{
  "kind": "script",
  "name": "Preparing for time series based on a datetime or numeric key field with constant separation",
  "description": "Preparing time series data with flaws. The kind of problems addressed in the script are:\n\n- Unsorted rows: Data may not be in an ascending sequence\n\n- Gaps between rows: Some of the rows may be missing, according to the values found in the epoch or datetime field used as key to the sequence and the user-given lapse to be used\n\n- Multiple rows: There might be more than one row per key-field value. If that happens, the script will keep the first row.\n\nThe process sorts the rows according to the given key-field, fills the gaps as defined by it and the expected lapse to be found between rows and removes multiplicities. The result will be a new timeseries-normalized dataset that can be used to build a time series from it. \n\n_Input Parameters_\n\n- dataset-id: ID of the original dataset to be fixed\n\n- key-field: Name of the field that contains the key to the time series sequence. The field is expected to be either a numeric (possibly epoch) field or a datetime field. If the latter is used, the `dt-field-format` field is used to define the original field parsing.\n- `dt-field-format`: Format used to parse the `key-field` information (only used if that's a datetime field).\n\n- `lapse`: Uniform interval expected between the consecutive `key-field` values.\n\n_Output_\n\n- Time series normalized dataset: It will contain a sorted and uniformely sequence of rows. If the `key-field` used in the original dataset is a datetime field, a new field named after it with an `_epoch` suffix will be added to it containing the epoch equivalence of the original timestamps. It also adds a new `day_number` that stores the consecutive number of days.", "source_code": "script.whizzml",
  "inputs":
    [
        {"description": "Origin Dataset ID",
         "name": "dataset-id",
         "type": "dataset-id"},
        {"description": "Field used as sorting sequence key. It can be either an epoch field (no format needed) or a datetime field",
         "name": "key-field",
         "type": "string"},
        {"default": "\"YYYY-MM-dd\"",
         "description": "Format of the datetime key field (if needed)",
         "name": "dt-field-format", "type": "string"},
        {"description": "Expected interval between two key-field values in miliseconds",
         "name": "lapse",
         "type": "number"}
    ],
  "outputs":
    [
        {"description": "Output description",
         "name": "normalized-dataset",
         "type": "dataset-id"}
    ]
}
